ylttg/RL78G11_Ultralowpower_clockgenerator/iodefine.h
#define TKBPAHFT0      (*(volatile __near unsigned char  *)0x435)
#define TKBPAHFT0_bit  (*(volatile __near __bitf_T *)0x435)
#define TKBPAHTT00     (((volatile __near __bitf_T *)0x435)->no0)
#define TKBPAHTT01     (((volatile __near __bitf_T *)0x435)->no1)
#define TKBPAFLG0      (*(volatile __near unsigned char  *)0x436)
#define TKBPAFLG0_bit  (*(volatile __near __bitf_T *)0x436)
#define TKBPAHIF00     (((volatile __near __bitf_T *)0x436)->no0)
#define TKBPAFIF00     (((volatile __near __bitf_T *)0x436)->no1)
#define TKBPAHIF01     (((volatile __near __bitf_T *)0x436)->no2)
#define TKBPAFIF01     (((volatile __near __bitf_T *)0x436)->no3)
#define TKBPAHSF00     (((volatile __near __bitf_T *)0x436)->no4)
#define TKBPAFSF00     (((volatile __near __bitf_T *)0x436)->no5)
#define TKBPAHSF01     (((volatile __near __bitf_T *)0x436)->no6)
#define TKBPAFSF01     (((volatile __near __bitf_T *)0x436)->no7)
#define TKBPACTL02     (*(volatile __near unsigned char  *)0x437)
#define TKBPACTL02_bit (*(volatile __near __bitf_T *)0x437)
#define TKBPACE00      (((volatile __near __bitf_T *)0x437)->no0)
#define TKBPACE01      (((volatile __near __bitf_T *)0x437)->no1)
#define PFSEL0         (*(volatile __near unsigned char  *)0x440)
#define PFSEL0_bit     (*(volatile __near __bitf_T *)0x440)
#define TMRSTEN0       (((volatile __near __bitf_T *)0x440)->no0)
#define TMRSTEN1       (((volatile __near __bitf_T *)0x440)->no1)
#define PNFEN0         (((volatile __near __bitf_T *)0x440)->no2)
#define PNFEN1         (((volatile __near __bitf_T *)0x440)->no3)
#define INTPINV0       (((volatile __near __bitf_T *)0x440)->no4)
#define INTPINV1       (((volatile __near __bitf_T *)0x440)->no5)
#define INTPEG         (*(volatile __near unsigned char  *)0x441)
#define INTPEG_bit     (*(volatile __near __bitf_T *)0x441)
#define INTFE          (*(volatile __near unsigned char  *)0x448)
#define INTFE_bit      (*(volatile __near __bitf_T *)0x448)
#define INTADFE        (((volatile __near __bitf_T *)0x448)->no0)
#define INTITFE        (((volatile __near __bitf_T *)0x448)->no1)
#define INTIT00FE      (((volatile __near __bitf_T *)0x448)->no2)
#define INTIT01FE      (((volatile __near __bitf_T *)0x448)->no3)
#define INTTMKB0FE     (((volatile __near __bitf_T *)0x448)->no4)
#define INTDOCFE       (((volatile __near __bitf_T *)0x448)->no5)
#define INTCMP0FE      (((volatile __near __bitf_T *)0x448)->no6)
#define INTCMP1FE      (((volatile __near __bitf_T *)0x448)->no7)
#define INTFOCTL0      (*(volatile __near unsigned char  *)0x449)
#define INTFOCTL0_bit  (*(volatile __near __bitf_T *)0x449)
#define INTFOCTL1      (*(volatile __near unsigned char  *)0x44A)
#define INTFOCTL1_bit  (*(volatile __near __bitf_T *)0x44A)
#define INTFCLR        (((volatile __near __bitf_T *)0x44A)->no0)
#define TRT0           (*(volatile __near unsigned short *)0x500)
#define TRT00          (*(volatile __near unsigned char  *)0x500)
#define TRT01          (*(volatile __near unsigned char  *)0x501)
#define DOCR           (*(volatile __near unsigned char  *)0x511)
#define DOCR_bit       (*(volatile __near __bitf_T *)0x511)
#define OMS0           (((volatile __near __bitf_T *)0x511)->no0)
#define OMS1           (((volatile __near __bitf_T *)0x511)->no1)
#define DCSEL          (((volatile __near __bitf_T *)0x511)->no2)
#define DOPCIE         (((volatile __near __bitf_T *)0x511)->no4)
#define DOPCF          (((volatile __near __bitf_T *)0x511)->no5)
#define DOPCFCL        (((volatile __near __bitf_T *)0x511)->no6)
#define DODIR          (*(volatile __near unsigned short *)0x512)
#define DODSR          (*(volatile __near unsigned short *)0x514)
#define P2             (*(volatile __near unsigned char  *)0xFF02)
#define P2_bit         (*(volatile __near __bitf_T *)0xFF02)
#define P3             (*(volatile __near unsigned char  *)0xFF03)
#define P3_bit         (*(volatile __near __bitf_T *)0xFF03)
#define P4             (*(volatile __near unsigned char  *)0xFF04)
#define P4_bit         (*(volatile __near __bitf_T *)0xFF04)
#define P5             (*(volatile __near unsigned char  *)0xFF05)
#define P5_bit         (*(volatile __near __bitf_T *)0xFF05)
#define P12            (*(volatile __near unsigned char  *)0xFF0C)
#define P12_bit        (*(volatile __near __bitf_T *)0xFF0C)
#define P13            (*(volatile __near unsigned char  *)0xFF0D)
#define P13_bit        (*(volatile __near __bitf_T *)0xFF0D)
#define SDR00          (*(volatile __near unsigned short *)0xFF10)
#define TXD0           (*(volatile __near unsigned char  *)0xFF10)
#define SDR01          (*(volatile __near unsigned short *)0xFF12)
#define RXD0           (*(volatile __near unsigned char  *)0xFF12)
#define TDR00          (*(volatile __near unsigned short *)0xFF18)
#define TDR01          (*(volatile __near unsigned short *)0xFF1A)
#define TDR01L         (*(volatile __near unsigned char  *)0xFF1A)
#define TDR01H         (*(volatile __near unsigned char  *)0xFF1B)
#define ADCR           (*(volatile __near unsigned short *)0xFF1E)
#define ADCRH          (*(volatile __near unsigned char  *)0xFF1F)
#define PM2            (*(volatile __near unsigned char  *)0xFF22)
#define PM2_bit        (*(volatile __near __bitf_T *)0xFF22)
#define PM3            (*(volatile __near unsigned char  *)0xFF23)
#define PM3_bit        (*(volatile __near __bitf_T *)0xFF23)
#define PM4            (*(volatile __near unsigned char  *)0xFF24)
#define PM4_bit        (*(volatile __near __bitf_T *)0xFF24)
#define PM5            (*(volatile __near unsigned char  *)0xFF25)
#define PM5_bit        (*(volatile __near __bitf_T *)0xFF25)
#define ADM0           (*(volatile __near unsigned char  *)0xFF30)
#define ADM0_bit       (*(volatile __near __bitf_T *)0xFF30)
#define ADCE           (((volatile __near __bitf_T *)0xFF30)->no0)
#define ADCS           (((volatile __near __bitf_T *)0xFF30)->no7)
#define ADS            (*(volatile __near unsigned char  *)0xFF31)
#define ADS_bit        (*(volatile __near __bitf_T *)0xFF31)
#define ADM1           (*(volatile __near unsigned char  *)0xFF32)
#define ADM1_bit       (*(volatile __near __bitf_T *)0xFF32)
#define KRCTL          (*(volatile __near unsigned char  *)0xFF34)
#define KRCTL_bit      (*(volatile __near __bitf_T *)0xFF34)
#define KREG           (((volatile __near __bitf_T *)0xFF34)->no0)
#define KRMD           (((volatile __near __bitf_T *)0xFF34)->no7)
#define KRF            (*(volatile __near unsigned char  *)0xFF35)
#define KRM0           (*(volatile __near unsigned char  *)0xFF37)
#define KRM0_bit       (*(volatile __near __bitf_T *)0xFF37)
#define EGP0           (*(volatile __near unsigned char  *)0xFF38)
#define EGP0_bit       (*(volatile __near __bitf_T *)0xFF38)
#define EGN0           (*(volatile __near unsigned char  *)0xFF39)
#define EGN0_bit       (*(volatile __near __bitf_T *)0xFF39)
#define EGP1           (*(volatile __near unsigned char  *)0xFF3A)
#define EGP1_bit       (*(volatile __near __bitf_T *)0xFF3A)
#define EGN1           (*(volatile __near unsigned char  *)0xFF3B)
#define EGN1_bit       (*(volatile __near __bitf_T *)0xFF3B)
#define DACS0          (*(volatile __near unsigned char  *)0xFF3C)
#define DACS1          (*(volatile __near unsigned char  *)0xFF3D)
#define DAM            (*(volatile __near unsigned char  *)0xFF3E)
#define DAM_bit        (*(volatile __near __bitf_T *)0xFF3E)
#define DACE0          (((volatile __near __bitf_T *)0xFF3E)->no4)
#define DACE1          (((volatile __near __bitf_T *)0xFF3E)->no5)
#define SDR02          (*(volatile __near unsigned short *)0xFF44)
#define SIO10          (*(volatile __near unsigned char  *)0xFF44)
#define TXD1           (*(volatile __near unsigned char  *)0xFF44)
#define SDR03          (*(volatile __near unsigned short *)0xFF46)
#define RXD1           (*(volatile __near unsigned char  *)0xFF46)
#define SIO11          (*(volatile __near unsigned char  *)0xFF46)
#define IICA0          (*(volatile __near unsigned char  *)0xFF50)
#define IICS0          (*(volatile __near unsigned char  *)0xFF51)
#define IICS0_bit      (*(volatile __near __bitf_T *)0xFF51)
#define SPD0           (((volatile __near __bitf_T *)0xFF51)->no0)
#define STD0           (((volatile __near __bitf_T *)0xFF51)->no1)
#define ACKD0          (((volatile __near __bitf_T *)0xFF51)->no2)
#define TRC0           (((volatile __near __bitf_T *)0xFF51)->no3)
#define COI0           (((volatile __near __bitf_T *)0xFF51)->no4)
#define EXC0           (((volatile __near __bitf_T *)0xFF51)->no5)
#define ALD0           (((volatile __near __bitf_T *)0xFF51)->no6)
#define MSTS0          (((volatile __near __bitf_T *)0xFF51)->no7)
#define IICF0          (*(volatile __near unsigned char  *)0xFF52)
#define IICF0_bit      (*(volatile __near __bitf_T *)0xFF52)
#define IICRSV0        (((volatile __near __bitf_T *)0xFF52)->no0)
#define STCEN0         (((volatile __near __bitf_T *)0xFF52)->no1)
#define IICBSY0        (((volatile __near __bitf_T *)0xFF52)->no6)
#define STCF0          (((volatile __near __bitf_T *)0xFF52)->no7)
#define TDR02          (*(volatile __near unsigned short *)0xFF64)
#define TDR03          (*(volatile __near unsigned short *)0xFF66)
#define TDR03L         (*(volatile __near unsigned char  *)0xFF66)
#define TDR03H         (*(volatile __near unsigned char  *)0xFF67)
#define ITMC           (*(volatile __near unsigned short *)0xFF90)
#define CMC            (*(volatile __near unsigned char  *)0xFFA0)
#define CSC            (*(volatile __near unsigned char  *)0xFFA1)
#define CSC_bit        (*(volatile __near __bitf_T *)0xFFA1)
#define HIOSTOP        (((volatile __near __bitf_T *)0xFFA1)->no0)
#define MIOEN          (((volatile __near __bitf_T *)0xFFA1)->no1)
#define MSTOP          (((volatile __near __bitf_T *)0xFFA1)->no7)
#define OSTC           (*(volatile __near unsigned char  *)0xFFA2)
#define OSTC_bit       (*(volatile __near __bitf_T *)0xFFA2)
#define OSTS           (*(volatile __near unsigned char  *)0xFFA3)
#define CKC            (*(volatile __near unsigned char  *)0xFFA4)
#define CKC_bit        (*(volatile __near __bitf_T *)0xFFA4)
#define MCM1           (((volatile __near __bitf_T *)0xFFA4)->no0)
#define MCS1           (((volatile __near __bitf_T *)0xFFA4)->no1)
#define MCM0           (((volatile __near __bitf_T *)0xFFA4)->no4)
#define MCS            (((volatile __near __bitf_T *)0xFFA4)->no5)
#define CSS            (((volatile __near __bitf_T *)0xFFA4)->no6)
#define CLS            (((volatile __near __bitf_T *)0xFFA4)->no7)
#define CKS0           (*(volatile __near unsigned char  *)0xFFA5)
#define CKS0_bit       (*(volatile __near __bitf_T *)0xFFA5)
#define PCLOE0         (((volatile __near __bitf_T *)0xFFA5)->no7)
#define CKSEL          (*(volatile __near unsigned char  *)0xFFA7)
#define CKSEL_bit      (*(volatile __near __bitf_T *)0xFFA7)
#define SELLOSC        (((volatile __near __bitf_T *)0xFFA7)->no0)
#define RESF           (*(volatile __near unsigned char  *)0xFFA8)
#define LVIM           (*(volatile __near unsigned char  *)0xFFA9)
#define LVIM_bit       (*(volatile __near __bitf_T *)0xFFA9)
#define LVIF           (((volatile __near __bitf_T *)0xFFA9)->no0)
#define LVIOMSK        (((volatile __near __bitf_T *)0xFFA9)->no1)
#define LVISEN         (((volatile __near __bitf_T *)0xFFA9)->no7)
#define LVIS           (*(volatile __near unsigned char  *)0xFFAA)
#define LVIS_bit       (*(volatile __near __bitf_T *)0xFFAA)
#define LVILV          (((volatile __near __bitf_T *)0xFFAA)->no0)
#define LVIMD          (((volatile __near __bitf_T *)0xFFAA)->no7)
#define WDTE           (*(volatile __near unsigned char  *)0xFFAB)
#define CRCIN          (*(volatile __near unsigned char  *)0xFFAC)
#define IF2            (*(volatile __near unsigned short *)0xFFD0)
#define IF2L           (*(volatile __near unsigned char  *)0xFFD0)
#define IF2L_bit       (*(volatile __near __bitf_T *)0xFFD0)
#define IF2H           (*(volatile __near unsigned char  *)0xFFD1)
#define IF2H_bit       (*(volatile __near __bitf_T *)0xFFD1)
#define CMPIF0         (((volatile __near __bitf_T *)0xFFD0)->no0)
#define CMPIF1         (((volatile __near __bitf_T *)0xFFD0)->no1)
#define DOCIF          (((volatile __near __bitf_T *)0xFFD0)->no2)
#define ITIF00         (((volatile __near __bitf_T *)0xFFD0)->no3)
#define ITIF01         (((volatile __near __bitf_T *)0xFFD0)->no4)
#define TMKBIF0        (((volatile __near __bitf_T *)0xFFD0)->no5)
#define FLIF           (((volatile __near __bitf_T *)0xFFD0)->no7)
#define FOIF           (((volatile __near __bitf_T *)0xFFD1)->no0)
#define MK2            (*(volatile __near unsigned short *)0xFFD4)
#define MK2L           (*(volatile __near unsigned char  *)0xFFD4)
#define MK2L_bit       (*(volatile __near __bitf_T *)0xFFD4)
#define MK2H           (*(volatile __near unsigned char  *)0xFFD5)
#define MK2H_bit       (*(volatile __near __bitf_T *)0xFFD5)
#define CMPMK0         (((volatile __near __bitf_T *)0xFFD4)->no0)
#define CMPMK1         (((volatile __near __bitf_T *)0xFFD4)->no1)
#define DOCMK          (((volatile __near __bitf_T *)0xFFD4)->no2)
#define ITMK00         (((volatile __near __bitf_T *)0xFFD4)->no3)
#define ITMK01         (((volatile __near __bitf_T *)0xFFD4)->no4)
#define TMKBMK0        (((volatile __near __bitf_T *)0xFFD4)->no5)
#define FLMK           (((volatile __near __bitf_T *)0xFFD4)->no7)
#define FOMK           (((volatile __near __bitf_T *)0xFFD5)->no0)
#define PR02           (*(volatile __near unsigned short *)0xFFD8)
#define PR02L          (*(volatile __near unsigned char  *)0xFFD8)
#define PR02L_bit      (*(volatile __near __bitf_T *)0xFFD8)
#define PR02H          (*(volatile __near unsigned char  *)0xFFD9)
#define PR02H_bit      (*(volatile __near __bitf_T *)0xFFD9)
#define CMPPR00        (((volatile __near __bitf_T *)0xFFD8)->no0)
#define CMPPR01        (((volatile __near __bitf_T *)0xFFD8)->no1)
#define DOCPR0         (((volatile __near __bitf_T *)0xFFD8)->no2)
#define ITPR000        (((volatile __near __bitf_T *)0xFFD8)->no3)
#define ITPR001        (((volatile __near __bitf_T *)0xFFD8)->no4)
#define TMKBPR00       (((volatile __near __bitf_T *)0xFFD8)->no5)
#define FLPR0          (((volatile __near __bitf_T *)0xFFD8)->no7)
#define FOPR0          (((volatile __near __bitf_T *)0xFFD9)->no0)
#define PR12           (*(volatile __near unsigned short *)0xFFDC)
#define PR12L          (*(volatile __near unsigned char  *)0xFFDC)
#define PR12L_bit      (*(volatile __near __bitf_T *)0xFFDC)
#define PR12H          (*(volatile __near unsigned char  *)0xFFDD)
#define PR12H_bit      (*(volatile __near __bitf_T *)0xFFDD)
#define CMPPR10        (((volatile __near __bitf_T *)0xFFDC)->no0)
#define CMPPR11        (((volatile __near __bitf_T *)0xFFDC)->no1)
#define DOCPR1         (((volatile __near __bitf_T *)0xFFDC)->no2)
#define ITPR100        (((volatile __near __bitf_T *)0xFFDC)->no3)
#define ITPR101        (((volatile __near __bitf_T *)0xFFDC)->no4)
#define TMKBPR10       (((volatile __near __bitf_T *)0xFFDC)->no5)
#define FLPR1          (((volatile __near __bitf_T *)0xFFDC)->no7)
#define FOPR1          (((volatile __near __bitf_T *)0xFFDD)->no0)
#define IF0            (*(volatile __near unsigned short *)0xFFE0)
#define IF0L           (*(volatile __near unsigned char  *)0xFFE0)
#define IF0L_bit       (*(volatile __near __bitf_T *)0xFFE0)
#define IF0H           (*(volatile __near unsigned char  *)0xFFE1)
#define IF0H_bit       (*(volatile __near __bitf_T *)0xFFE1)
#define WDTIIF         (((volatile __near __bitf_T *)0xFFE0)->no0)
#define LVIIF          (((volatile __near __bitf_T *)0xFFE0)->no1)
#define PIF0           (((volatile __near __bitf_T *)0xFFE0)->no2)
#define PIF1           (((volatile __near __bitf_T *)0xFFE0)->no3)
#define PIF2           (((volatile __near __bitf_T *)0xFFE0)->no4)
#define PIF3           (((volatile __near __bitf_T *)0xFFE0)->no5)
#define PIF4           (((volatile __near __bitf_T *)0xFFE0)->no6)
#define STIF0          (((volatile __near __bitf_T *)0xFFE1)->no1)
#define SRIF0          (((volatile __near __bitf_T *)0xFFE1)->no2)
#define SREIF0         (((volatile __near __bitf_T *)0xFFE1)->no5)
#define TMIF00         (((volatile __near __bitf_T *)0xFFE1)->no6)
#define CSIIF10        (((volatile __near __bitf_T *)0xFFE1)->no7)
#define STIF1          (((volatile __near __bitf_T *)0xFFE1)->no7)
#define IF1            (*(volatile __near unsigned short *)0xFFE2)
#define IF1L           (*(volatile __near unsigned char  *)0xFFE2)
#define IF1L_bit       (*(volatile __near __bitf_T *)0xFFE2)
#define IF1H           (*(volatile __near unsigned char  *)0xFFE3)
#define IF1H_bit       (*(volatile __near __bitf_T *)0xFFE3)
#define CSIIF11        (((volatile __near __bitf_T *)0xFFE2)->no0)
#define IICIF11        (((volatile __near __bitf_T *)0xFFE2)->no0)
#define SRIF1          (((volatile __near __bitf_T *)0xFFE2)->no0)
#define SREIF1         (((volatile __near __bitf_T *)0xFFE2)->no1)
#define IICAIF0        (((volatile __near __bitf_T *)0xFFE2)->no2)
#define TMIF01H        (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF03H        (((volatile __near __bitf_T *)0xFFE2)->no4)
#define TMIF01         (((volatile __near __bitf_T *)0xFFE2)->no5)
#define TMIF02         (((volatile __near __bitf_T *)0xFFE2)->no6)
#define TMIF03         (((volatile __near __bitf_T *)0xFFE2)->no7)
#define ADIF           (((volatile __near __bitf_T *)0xFFE3)->no0)
#define TMKAIF         (((volatile __near __bitf_T *)0xFFE3)->no1)
#define KRIF           (((volatile __near __bitf_T *)0xFFE3)->no2)
#define PIF9           (((volatile __near __bitf_T *)0xFFE3)->no5)
#define PIF10          (((volatile __near __bitf_T *)0xFFE3)->no6)
#define PIF11          (((volatile __near __bitf_T *)0xFFE3)->no7)
#define MK0            (*(volatile __near unsigned short *)0xFFE4)
#define MK0L           (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit       (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H           (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit       (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK         (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK          (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0           (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1           (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2           (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3           (((volatile __near __bitf_T *)0xFFE4)->no5)
#define PMK4           (((volatile __near __bitf_T *)0xFFE4)->no6)
#define STMK0          (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SRMK0          (((volatile __near __bitf_T *)0xFFE5)->no2)
#define SREMK0         (((volatile __near __bitf_T *)0xFFE5)->no5)
#define TMMK00         (((volatile __near __bitf_T *)0xFFE5)->no6)
#define CSIMK10        (((volatile __near __bitf_T *)0xFFE5)->no7)
#define STMK1          (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1            (*(volatile __near unsigned short *)0xFFE6)
#define MK1L           (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit       (*(volatile __near __bitf_T *)0xFFE6)
#define MK1H           (*(volatile __near unsigned char  *)0xFFE7)
#define MK1H_bit       (*(volatile __near __bitf_T *)0xFFE7)
#define CSIMK11        (((volatile __near __bitf_T *)0xFFE6)->no0)
#define IICMK11        (((volatile __near __bitf_T *)0xFFE6)->no0)
#define SRMK1          (((volatile __near __bitf_T *)0xFFE6)->no0)
#define SREMK1         (((volatile __near __bitf_T *)0xFFE6)->no1)
#define IICAMK0        (((volatile __near __bitf_T *)0xFFE6)->no2)
#define TMMK01H        (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK03H        (((volatile __near __bitf_T *)0xFFE6)->no4)
#define TMMK01         (((volatile __near __bitf_T *)0xFFE6)->no5)
#define TMMK02         (((volatile __near __bitf_T *)0xFFE6)->no6)
#define TMMK03         (((volatile __near __bitf_T *)0xFFE6)->no7)
#define ADMK           (((volatile __near __bitf_T *)0xFFE7)->no0)
#define TMKAMK         (((volatile __near __bitf_T *)0xFFE7)->no1)
#define KRMK           (((volatile __near __bitf_T *)0xFFE7)->no2)
#define PMK9           (((volatile __near __bitf_T *)0xFFE7)->no5)
#define PMK10          (((volatile __near __bitf_T *)0xFFE7)->no6)
#define PMK11          (((volatile __near __bitf_T *)0xFFE7)->no7)
#define PR00           (*(volatile __near unsigned short *)0xFFE8)
#define PR00L          (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit      (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H          (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit      (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0        (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0         (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00          (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01          (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02          (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03          (((volatile __near __bitf_T *)0xFFE8)->no5)
#define PPR04          (((volatile __near __bitf_T *)0xFFE8)->no6)
#define STPR00         (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SRPR00         (((volatile __near __bitf_T *)0xFFE9)->no2)
#define SREPR00        (((volatile __near __bitf_T *)0xFFE9)->no5)
#define TMPR000        (((volatile __near __bitf_T *)0xFFE9)->no6)
#define CSIPR010       (((volatile __near __bitf_T *)0xFFE9)->no7)
#define STPR01         (((volatile __near __bitf_T *)0xFFE9)->no7)
#define PR01           (*(volatile __near unsigned short *)0xFFEA)
#define PR01L          (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit      (*(volatile __near __bitf_T *)0xFFEA)
#define PR01H          (*(volatile __near unsigned char  *)0xFFEB)
#define PR01H_bit      (*(volatile __near __bitf_T *)0xFFEB)
#define CSIPR011       (((volatile __near __bitf_T *)0xFFEA)->no0)
#define IICPR011       (((volatile __near __bitf_T *)0xFFEA)->no0)
#define SRPR01         (((volatile __near __bitf_T *)0xFFEA)->no0)
#define SREPR01        (((volatile __near __bitf_T *)0xFFEA)->no1)
#define IICAPR00       (((volatile __near __bitf_T *)0xFFEA)->no2)
#define TMPR001H       (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR003H       (((volatile __near __bitf_T *)0xFFEA)->no4)
#define TMPR001        (((volatile __near __bitf_T *)0xFFEA)->no5)
#define TMPR002        (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR003        (((volatile __near __bitf_T *)0xFFEA)->no7)
#define ADPR0          (((volatile __near __bitf_T *)0xFFEB)->no0)
#define TMKAPR0        (((volatile __near __bitf_T *)0xFFEB)->no1)
#define KRPR0          (((volatile __near __bitf_T *)0xFFEB)->no2)
#define PPR09          (((volatile __near __bitf_T *)0xFFEB)->no5)
#define PPR010         (((volatile __near __bitf_T *)0xFFEB)->no6)
#define PPR011         (((volatile __near __bitf_T *)0xFFEB)->no7)
#define PR10           (*(volatile __near unsigned short *)0xFFEC)
#define PR10L          (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit      (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H          (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit      (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1        (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1         (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10          (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11          (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12          (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13          (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14          (((volatile __near __bitf_T *)0xFFEC)->no6)
