ylttg/RL78G11_Ultralowpower_clockgenerator/iodefine.h
#define STPR10         (((volatile __near __bitf_T *)0xFFED)->no1)
#define SRPR10         (((volatile __near __bitf_T *)0xFFED)->no2)
#define SREPR10        (((volatile __near __bitf_T *)0xFFED)->no5)
#define TMPR100        (((volatile __near __bitf_T *)0xFFED)->no6)
#define CSIPR110       (((volatile __near __bitf_T *)0xFFED)->no7)
#define STPR11         (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11           (*(volatile __near unsigned short *)0xFFEE)
#define PR11L          (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit      (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H          (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit      (*(volatile __near __bitf_T *)0xFFEF)
#define CSIPR111       (((volatile __near __bitf_T *)0xFFEE)->no0)
#define IICPR111       (((volatile __near __bitf_T *)0xFFEE)->no0)
#define SRPR11         (((volatile __near __bitf_T *)0xFFEE)->no0)
#define SREPR11        (((volatile __near __bitf_T *)0xFFEE)->no1)
#define IICAPR10       (((volatile __near __bitf_T *)0xFFEE)->no2)
#define TMPR101H       (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR103H       (((volatile __near __bitf_T *)0xFFEE)->no4)
#define TMPR101        (((volatile __near __bitf_T *)0xFFEE)->no5)
#define TMPR102        (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR103        (((volatile __near __bitf_T *)0xFFEE)->no7)
#define ADPR1          (((volatile __near __bitf_T *)0xFFEF)->no0)
#define TMKAPR1        (((volatile __near __bitf_T *)0xFFEF)->no1)
#define KRPR1          (((volatile __near __bitf_T *)0xFFEF)->no2)
#define PPR19          (((volatile __near __bitf_T *)0xFFEF)->no5)
#define PPR110         (((volatile __near __bitf_T *)0xFFEF)->no6)
#define PPR111         (((volatile __near __bitf_T *)0xFFEF)->no7)
#define MACRL          (*(volatile __near unsigned short *)0xFFF0)
#define MACRH          (*(volatile __near unsigned short *)0xFFF2)
#define PMC            (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit        (*(volatile __near __bitf_T *)0xFFFE)
#define MAA            (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTSRO                          0x0004
#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTST0                          0x0016
#define INTSR0                          0x0018
#define INTSRE0                         0x001E
#define INTTM00                         0x0020
#define INTCSI10                        0x0022
#define INTST1                          0x0022
#define INTCSI11                        0x0024
#define INTIIC11                        0x0024
#define INTSR1                          0x0024
#define INTSRE1                         0x0026
#define INTIICA0                        0x0028
#define INTTM01H                        0x002A
#define INTTM03H                        0x002C
#define INTTM01                         0x002E
#define INTTM02                         0x0030
#define INTTM03                         0x0032
#define INTAD                           0x0034
#define INTIT                           0x0036
#define INTKR                           0x0038
#define INTP9                           0x003E
#define INTP10                          0x0040
#define INTP11                          0x0042
#define INTCMP0                         0x0044
#define INTCMP1                         0x0046
#define INTDOC                          0x0048
#define INTIT00                         0x004A
#define INTIT01                         0x004C
#define INTTMKB0                        0x004E
#define INTFL                           0x0052
#define INTFO                           0x0054

#endif
